#pragma once
#include <string>
#include <vector>
#include <json.hpp>


//=========================================================================
// C++とWrbAPIをつなぐクラス
//=========================================================================
class YWebApiManager {
public:
    //=========================================================================
    // シングルトンインスタンスの取得など
    //=========================================================================
    static YWebApiManager& GetInstance();
    YWebApiManager(const YWebApiManager&) = delete;
    YWebApiManager& operator=(const YWebApiManager&) = delete;


    //=========================================================================
    // 基本的な処理
    //=========================================================================
    bool Initialize();
    void Finalize();
    void DrawLogWindow();

    //=========================================================================
    // 公開関数
    //=========================================================================
    // WebAPIにGETリクエストを送り、パース済みのJSONを返す関数
    nlohmann::json SendGetRequest(const std::string& url);
	void ClearLogs() { logs_.clear(); }


    //=========================================================================
    // アクセッサ
    //=========================================================================
	const std::vector<std::string>& GetLogs() const { return logs_; }
private:
    //=========================================================================
    // 内部関数
    //=========================================================================
    // 外部からの new や実体化を禁止
    YWebApiManager() = default;
    ~YWebApiManager() = default;

    // cURLがデータを受信したときに呼ばれる静的コールバック関数
    static size_t WriteCallback(void* contents, size_t size, size_t nmemb, void* userp);
	// ログを追加
    void AddLog(const std::string& logs);

private:
    //=========================================================================
    // メンバ変数
    //=========================================================================
    
    // 初期化されたか
    bool initialized_ = false;

    // ログの保存
    std::vector<std::string> logs_;
};

